[
    {
        "title": "First Round's On Me | Software Engineering Intern (Python/Django)\nFirst Round's On Me | Software Engineering Intern (Python/Django)",
        "company": "First Round's On Me",
        "location": "United States (Remote)",
        "link": "https://www.linkedin.com/jobs/view/4233053228",
        "image": "https://media.licdn.com/dms/image/v2/D4E0BAQHsqLkXg95B4A/company-logo_100_100/company-logo_100_100/0/1719028927002/firstroundsonme_logo?e=1753315200&v=beta&t=0-Z2knQUDnOeulwRok0wdYZ19NVaxwTebqaLNtGFiuY",
        "details": "About the job\n\nCompany Overview:\n\nFirst Rounds on Me is a revolutionary dating app designed for modern singles who are tired of the frustrations of today's dating scene. The app focuses on helping users plan dates and build genuine connections by requiring them to match with others by planning a date with a date, time, and location. It allows users to chat with their date only 24 hours before the date, encouraging \"getting to know each other\" in real life (IRL). The founder, Joe Feminella, describes the app as a transformative movement redefining connection, aiming to cultivate a community where people embrace diversity and genuine connections over the 'like-minded' criteria.\n\n\n\n\nFirst Round’s on Me is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.\n\n\n\n\nLocations: New York, NY, Los Angeles, CA, Austin, TX, Boston, MA, Remote\n\n\n\n\nPosition Overview: \n\nWe are looking for a Software Engineering Intern (Python/Django) to join our technology team for a 3-month internship. You’ll help us build and scale real-world backend systems that power our dating platform. This is a hands-on role where you’ll gain experience working on production systems, writing scalable code, and contributing meaningfully to a fast-moving startup. High performers may be considered for co-op extensions or full-time roles.\n\n\n\n\nResponsibilities:\n\nDevelop and maintain backend services and APIs using Python and Django.\nCollaborate with frontend and mobile engineers to ensure seamless integrations.\nWrite clean, maintainable, and efficient code.\nParticipate in pair programming, code reviews, and agile standups.\nContribute to the scalability, reliability, and security of our backend architecture.\nEngage in real-world problem solving and system design discussions.\n\n\n\n\nQualifications:\n\nPursuing or recently completed a Bachelor's or Master's in Computer Science, Engineering, or related field and work experience.\nProficient in Python and Django.\nUnderstanding of web application architecture, REST APIs, and databases.\nStrong communication skills and a passion for building user-focused tech.\nBonus points for familiarity with Docker, AWS, PostgreSQL, and CI/CD tools.\nExtra love if you've built something live, contributed to open source, or dabbled in React Native.\n\n\n\n\nInterview Process:\n\nWe skip the Leetcode grind and get straight to what matters:\n\n\n\n\n1. Pair Programming Session – Work with one of our engineers on a real feature or bug fix.\n\n2. System Design Chat – Talk through how you'd design and scale a relevant feature.\n\n3. Behavioral Interview with CEO – A candid chat to learn about your goals, mindset, and fit.\n\n\n\n\nCompensation & Duration:\n\nDuration: 3 months\nCompensation: Industry standard, varies by experience and location\nPotential for extension into a full-time or co-op role based on performance\n\n\n\n\nHow to Apply:\n\nSend us your resume at careers@firstroundsonme.co and a short note about something cool you’ve built or why you’re hyped to join. Bonus for links to GitHub, live projects, or open-source contributions. \n\n\n\n\nMake sure that the title of your email is - Software Engineering Intern | <Full Name>\n\n\n\n\nSalary: $25-$35 per hour - Subject to change based on experience and location..."
    },
    {
        "title": "Python Developer\nPython Developer",
        "company": "Mercor",
        "location": "United States (Remote)",
        "link": "https://www.linkedin.com/jobs/view/4234888841",
        "image": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=1753315200&v=beta&t=7Kxd6brEtkTs2x4Nz4llf3NXxPdg7JiBX-J0_bU_vYE",
        "details": "About the job\n\nWe are hiring software engineers to assist a leading AI research lab with environment setup and dependency management for open-source Python projects. Your work will focus on configuring development environments, resolving dependency issues, and ensuring tests pass across various codebases. This is a remote, flexible role.\n\nJob requirements\n\nExpertise in Python, ideally at least 2 years of industry experience.\nFamiliarity with setting up development environments.\nHigh attention to detail as well as exceptional written and verbal communication skills.\n(Strongly Preferred) Lots of activity on Github, in particular lots of commits over the past year.\n\nMore details about the role\n\nPay Rate: 45-58$/hr \nThis project is focused on reviewing Python push requests in Github. It may slightly evolve with time, but strong Python competency is required anyway.\nThe project has a 2 week trial period up front to see if it’s a good mutual fit, and will extend beyond that based on performance.\nYou will be expected to commit between 20-40 hours per week. The hours are fully flexible and the opportunity is remote.\n\nRole Logistics\n\nYou’ll be paid weekly via Stripe Connect.\nYou’ll be an independent contractor, working through Mercor.\nThe advertised pay range is for US-based candidates, but we strive to keep rates competitive for all geographies.\n\nAbout Mercor\n\nOur team is based in San Francisco, CA.\nWe specialize in recruiting experts for top AI labs.\nOur investors include Benchmark, General Catalyst, Adam D’Angelo, Larry Summers, and Jack Dorsey.\n\n\n..."
    },
    {
        "title": "Software Development Intern - Python and Linux\nSoftware Development Intern - Python and Linux with verification",
        "company": "Fortra",
        "location": "United States (Remote)",
        "link": "https://www.linkedin.com/jobs/view/4235566685",
        "image": "https://media.licdn.com/dms/image/v2/D4E0BAQEMM1452f4Yzg/company-logo_100_100/company-logo_100_100/0/1735137975051/fortra_logo?e=1753315200&v=beta&t=FQx-ie25kAXXIAWMLOyzOz3pBzgp5P2rIFMh9EyMz9A",
        "details": "About the job\n\nWhether you’re an experienced professional or just getting started, your contributions matter at Fortra. If you’re passionate about tackling meaningful challenges alongside talented team members committed to helping each other succeed, all while having lots of fun, we want to hear from you. We offer competitive benefits and salaries, personal and professional development opportunities, flexibility, and much more!\n\nAt Fortra, we’re breaking the attack chain. Ready to join us?\n\nThis position is responsible for working as part of a team, enhancing and maintaining existing software products. The ideal candidate is enrolled in a related software development program and has a base understanding of Python and Linux.\n\nTerm: June to August 2025\n\nWhat You'll Do\n\n\nImplement all assigned tasks. \nWill work within a team structure. \nActively participate in Agile ceremonies. \nOther duties as assigned. \n\n\nQualifications\n\n\nBe currently enrolled in a software development-related degree program. \nBase level understanding of Python and Linux. \nSome knowledge and understanding of the Agile/Scrum Project development methodology preferred. \nGood communications skills both verbal and written. \nThe ability to collaborate and work with a team are necessary. \nComfortable using simple commands on a Linux and/or macOS terminal\n\n\n3337\n\nVisit our website to learn more about why employees choose to work for Fortra. Remember to connect with us on LinkedIn.\n\nAs an EEO/Affirmative Action Employer, all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, veteran or disability status...."
    },
    {
        "title": "Stagiaire en développement Web\nStagiaire en développement Web",
        "company": "Bombellii Ventures",
        "location": "Boston, MA (Remote)",
        "link": "https://www.linkedin.com/jobs/view/4234700137",
        "image": "https://media.licdn.com/dms/image/v2/D4E0BAQF8ErZI4GJ5vA/company-logo_100_100/B4EZXENNSMG0AY-/0/1742753551778?e=1753315200&v=beta&t=LvKVoBHA8Vx17fY5uBqQpshhZnMpXqAOOji-QoOY6uM",
        "details": "About the job\n\nBombellii Ventures is a Venture Capital firm investing in early-stage founders, catalysing scalability and impact for a regenerative and equitable world. We back changemakers bringing software innovations to solve climate problems. Based in Boston, Bombellii Ventures invests at pre-seed and seed stage\n\n\n\n\nWe are seeking a motivated Web Development Intern to help build and launch our new company website. This is an exciting opportunity to gain hands-on experience and play a key role in shaping our digital presence.\n\n\n\n\nRole Overview\n\nAs a Web Development Intern, you will work closely with our team to design, develop, and launch a user-friendly, visually appealing website that reflects our brand and supports our business goals. You will be involved in all stages of the web development process, from planning and design to implementation and testing.\n\nKey Responsibilities\n\nAssist in the design, development, and launch of the company website, ensuring it is responsive and user-friendly.\nBuild new features and enhance website functionality using HTML, CSS, JavaScript, and potentially frameworks like React or PHP.\nCollaborate with team members to ensure the website aligns with our brand identity and business objectives.\nUpdate and manage website content, ensuring accuracy and consistency.\nConduct quality assurance testing, troubleshoot issues, and fix bugs.\nResearch and recommend improvements for SEO, accessibility, and web performance.\nDocument development processes and contribute to technical knowledge sharing.\nStay up to date with web development best practices and emerging technologies.\n\nDesired Skills & Qualifications\n\nCurrently enrolled in or recently graduated from a degree program in Computer Science, Web Development, New Media, or a related field.\nExperience with HTML, CSS, and JavaScript; familiarity with PHP and modern frameworks (React, Vue, Angular) is a plus.\nUnderstanding of UI/UX principles and responsive design.\nExperience with content management systems (WordPress, Wix, etc.) is a plus.\nStrong problem-solving skills and attention to detail.\nAbility to work independently and collaboratively in a team environment.\nExcellent written and verbal communication skills.\nEagerness to learn and adapt to new technologies and challenges.\n\nInternship Details\n\nDuration: [3-6 months]\nLocation: [Remote]\nSchedule: [Full-time]\nCompensation: [unpaid]\n\nHow to Apply\n\nPlease submit your resume, and (if available) links to any relevant web projects or portfolios...."
    },
    {
        "title": "Python Developer\nPython Developer with verification",
        "company": "Lensa",
        "location": "United States (Remote)",
        "link": "https://www.linkedin.com/jobs/view/4234743242",
        "image": "https://media.licdn.com/dms/image/v2/D4D0BAQEkHa-0Aki9XQ/company-logo_100_100/B4DZaKylu7GsAQ-/0/1746085240184/lensa_logo?e=1753315200&v=beta&t=bfFQ_5KH011xyAdh0DFkG3GQabElSRuUGy2vQJjb8eI",
        "details": "About the job\n\nLensa is the leading career site for job seekers at every stage of their career. Our client, Tactibit Technologies LLC, is seeking professionals. Apply via Lensa today!\n\nTactibit Technologies provides innovative information technology, cybersecurity, and cloud support services to the Federal Government. We support some of the nation's most critical and demanding projects including satellite operations, critical infrastructure, and search and rescue. We are a diverse team of hands-on professionals dedicated to solving problems and developing innovative solutions in support of our customers' critical missions. Our success is dependent on our inclusive, collaborative environment with a shared commitment to excellence in everything we do.\n\nAbout The Python Developer Position\n\nWe are looking for a talented Developer with in-depth experience developing Python software applications that run in a cloud environment to join our team in Suitland, MD. You will work closely with government staff to provide programming support for science products, algorithm development, and scientific data processing. You will design and implement fully automated enterprise pipelines using a suite of DevOps tools in an AWS cloud environment. You will collaborate with your team to develop, deploy, and support a cloud-native platform using a variety of programming languages and cloud-native services.\n\nWe expect you to have a passion for programming and for writing clean and and efficient Python code and a desire to work with satellite data and products for the public and government. Besides, you should be able to perform well working in a team, along with developers, engineers and scientists.\n\nPython Developer Responsibilities Are\n\n\nDesign and build serverless applications and infrastructure as code in the cloud following development standards and best practices \nDevelop tools, architecture components, and APIs in support of scientific application deployment \nCollaborate with software developers, scientists, system/network administrators, and other technical experts to automate cloud deployments and manage CI/CD pipelines \nPerform code reviews, refactoring, and source code repository maintenance \nFunction in a DevOps environment supporting development, testing, operations, and troubleshooting in a mission-critical environment \nSupport security testing, hardening, and assessments to meet strict compliance and operational security requirements \nWrite clean, maintainable and efficient code \nParticipate at all stages of the development lifecycle \nImplement best practices of test-driven development, continuous integration, SCRUM, refactoring and code standards, and so on \nStay informed about relevant new technologies and drive their continuous adoption and integration into design \n\n\nPython Developer Requirements Are\n\n\n4+ years of software development experience \n2+ years of experience of using AWS cloud services \n2+ years of experience with Python \n2+ years of experience with Unix/Linux operating systems \nExperience with core AWS services including S3, CodePipeline, and Lambda \nExperience with Perl and/or shell scripting \nExperience with version control systems (preferably Git) and issue tracking software (preferably Jira) \nFamiliarity with modern DevOps principles, practices, methods, and tools. \nStrong understanding of security best practices \nStrong problem solving skills and ability to work under pressure \nBS degree in Computer Science or other related area \nMust be a US Citizen or Lawful Permanent Resident and able to pass a full background investigation to obtain a security badge to enter the applicable government facility \n\n\nDesired Qualifications Are\n\n\nExperience with Federal government environments and concepts including FedRAMP, NIST Risk Management Framework, NIST SP 800-53 security controls \nExperience with containerized workloads in the cloud using Docker or Kubernetes \nExperience with NoSQL and/or SQL \nExperience writing infrastructure as code (IaC) using CloudFormation or Terraform \nEducational background or experience in satellites and or remote sensing \nIndustry certifications such as AWS certifications, CCSP, Cloud+, Security+, and GCLD..."
    },
    {
        "title": "Python Developer\nPython Developer",
        "company": "Trispoke Managed Services Pvt. Ltd.",
        "location": "United States (Remote)",
        "link": "https://www.linkedin.com/jobs/view/4233975947",
        "image": "https://media.licdn.com/dms/image/v2/D4D0BAQHMcQG37sozXw/company-logo_100_100/company-logo_100_100/0/1695409906483/trispoke_managed_services_logo?e=1753315200&v=beta&t=cSV7NKqJuHxEvbt_z5an57Z2h1XF9gBDHIV87TAHyWM",
        "details": "About the job\n\nAbout The Job\n\n\nSenior Python Developer with 7 -10 + years experience\nJavaScript\nAWS\nStrong Programming and analytical skills\nUnderstanding of Devops\n\n\nDesired Skills And Experience\n\n\nPYTHON\nJAVASCRIPT\nAWS\n\n\nhttps://www.linkedin.com/company/trispoke-managed-services-pvt-ltd/\n\nhttps://www.trispokeservices.com/jobs\n\nAnd above link for more jobs.\n\n#SeniorPythonDeveloper #AWS #JavaScript #DevOps #BackendDeveloper #SoftwareEngineering #PythonJobs #FullStackDeveloper #CloudComputing #TechJobs..."
    },
    {
        "title": "Python Developer\nPython Developer",
        "company": "Falcon Smart IT (FalconSmartIT)",
        "location": "United States (Remote)",
        "link": "https://www.linkedin.com/jobs/view/4233938315",
        "image": "https://media.licdn.com/dms/image/v2/C4D0BAQFs181Tff7n_A/company-logo_100_100/company-logo_100_100/0/1630553808876/falconsmartit_logo?e=1753315200&v=beta&t=K8HTnqBWTiNIfOa4tFv_8UoE3kwwly4fiSBI3zpFkuw",
        "details": "About the job\n\nJob Title: Python Developer\n\nLocation:100% Remote\n\nJob Type: Contract\n\n\n\n\nJob Description:\n\nMust be:\n\nA very senior Python Developer\nWith Azure AI Services experience..."
    }
]