[
    {
        "title": "Online Tutor",
        "company": "Filo",
        "location": "Dominica (Remote)",
        "link": "https://www.linkedin.com/jobs/view/4202329664",
        "image": "https://media.licdn.com/dms/image/v2/C4D0BAQFw5QXPmupPsQ/company-logo_100_100/company-logo_100_100/0/1667979005637/filoedtech_logo?e=1753315200&v=beta&t=WGjb6SfffmMoapgfM0YcTdLNIZ79xiP4SP7HEePupyY",
        "details": "About the job\n\nFilo is the world’s only live instant tutoring app where students are connected with expert tutors in less than 60 seconds for 1-1, interactive video sessions. Filo works 24*7 and the tutors are always available to explain, help, solve, in short, do whatever it takes to assist the student in that very moment. More than 1.5 million students across 15+ countries are using Filo to make their everyday learning better. Currently, there are 50,000+ tutors on Filo which makes it the largest community of tutors in the world.As a company, we are an emerging youth-oriented e-learning startup that thrives on problem-solving capability and a positive attitude. As a team, we are on a mission to democratise education and make quality learning accessible for every student around the world.\n\nThe Role\n\n\nThis is a part-time remote role for an Online Tutor at Filo. The Online Tutor will conduct interactive video tutoring sessions with students, assist in explaining concepts, solving problems, and ensuring students' understanding. Tutors will leverage Filo's platform to provide personalized support and guidance to students in various subjects.\n\n\nIdeal Profile\n\nQualifications\n\n\nStrong communication and interpersonal skills\nExpertise in subject matter being taught\nExperience in conducting online tutoring sessions\nAbility to explain concepts clearly and effectively\nPatience and adaptability in teaching methods\nComfortable with technology and online educational tools\nPrevious teaching or tutoring experience is a plus\nBachelor's degree in the relevant field\n\n\nWhat's on Offer?\n\n\nWork within a company with a solid track record of success\nAttractive salary & benefits\nFlexible working options"
    },
    {
        "title": "Tutor de Matemática de Nivel Universitario",
        "company": "LatinHire",
        "location": "Colombia (Remote)",
        "link": "https://www.linkedin.com/jobs/view/4230868254",
        "image": "https://media.licdn.com/dms/image/v2/C4D0BAQFwhzmwShxZpw/company-logo_100_100/company-logo_100_100/0/1630552129747/latinhire_com_logo?e=1753315200&v=beta&t=XPGhNGymQLGabzmtnPD5Kyz92WxXEsUsv_q8CFb5XB0",
        "details": "About the job\n\nEstamos buscando tutores para resolver ejercicios de matemática de nivel universitario, en español. Estos ejercicios son enviados por estudiantes, que esperan una respuesta en menos de 24 horas.\n\n\n\n\nLos tutores en este proyecto trabajan en modo freelance y pueden decidir la cantidad de horas que deseen trabajar, mientras se comprometan a producir como mínimo 40 soluciones al mes. \n\n\n\n\n¿Prefieres trabajar por la mañana? ¿Por la noche? ¿Pocas horas o muchas horas? La elección es tuya. Puedes ingresar al sistema en cualquier momento para recibir un ejercicio a solucionar. \n\n\n\n\nAdemás, puedes trabajar desde cualquier lugar, siempre y cuando cuentes con una computadora con conexión a Internet.\n\n\n\n\n¡Necesitamos tutores que puedan comenzar de inmediato!\n\n\n\n\nCARACTERÍSTICAS\n\nPago por respuesta, en dólares. \nTipo de contrato: freelance/autónomo. \nHorario: Flexible de libre elección\nComienzo: Inmediato\nDuración: Indefinida\n\n\n\n\nREQUISITOS\n\nCapacidad de resolver ejercicios de nivel universitario de al menos una de las siguientes materias: \nÁlgebra Lineal\nCálculo Diferencial e Integral\nCálculo Multivariable\nEstadística y Probabilidad\nEcuaciones Diferenciales\nMatemática Discreta\nEstudiante o graduado de una carrera universitaria cuya malla curricular incluya al menos una de las materias listadas en el punto anterior.\nComputadora con conexión a Internet.\nSin antecedentes penales.\n\n\n\n\nAcerca de LatinHire\n\nFundada en 2003, LatinHire es una empresa especializada en la gestión de equipos de expertos para instituciones de educación a distancia. Entre sus clientes figuran algunas de las empresas de educación más prestigiosas del mundo."
    },
    {
        "title": "AI Tutor",
        "company": "xAI",
        "location": "Latin America (Remote)",
        "link": "https://www.linkedin.com/jobs/view/4198825000",
        "image": "https://media.licdn.com/dms/image/v2/D560BAQFGK5Kkd1nUlg/company-logo_100_100/company-logo_100_100/0/1738099065875/xai_logo?e=1753315200&v=beta&t=aIr__5t6qfjXDy37mfEg6RqnjGGbxGgDJ5rmP5Dt99s",
        "details": "About the job\n\nThe AI Tutor role is a remote, full-time, temporary position that will last up to 6 months in duration. \n\nResponsibilities:\n\nUse proprietary software applications to provide input/labels on defined projects.\nSupport and ensure the delivery of high-quality curated data.\nPlay a pivotal role in supporting and contributing to the training of new tasks, working closely with the technical staff to ensure the successful development and implementation of cutting-edge initiatives/technologies.\nInteract with the technical staff to help improve the design of efficient annotation tools.\nEngage in diverse writing assignments to refine generative AI models.\n\nKey Qualifications:\n\nProficiency in reading and writing, both in informal and professional English.\nStrong research skills, and the ability to navigate various information resources, databases, and online resources are essential.\nYou display outstanding communication, interpersonal, analytical, and organizational capabilities.\nSolid reading comprehension skills combined with capacity to exercise autonomous judgment even when presented with limited data/material.\nYou have a strong passion for and commitment to technological advancements and innovation.\n\nPreferred Qualifications:\n\nIn addition to English, you have proficiency in reading and writing in Korean, Vietnamese, Chinese, German, Russian, Italian, French, Arabic, Indonesian, Turkish, Hindi, Persian, Spanish, and/or Portuguese\nYou possess experience in technical writing, journalism, or a professional writing setting.\n\nLocation, Hourly, and Other Expectations:\n\nThis position is fully remote.\nWe are unable to provide visa sponsorship.\nIf you are based in the US, please note we are unable to hire in the states of Wyoming and Illinois at this time.\nTeam members are expected to work from 9:00 am - 5:30 pm PST for the first two weeks of training and 9:00am - 5:30pm in their own timezone thereafter.\nFor those who will be working from a personal device, please note your computer must be capable of running Windows 10 or macOS BigSur 11.0 or later.\n\nCompensation and Benefits:\n\nThe pay for this role may range from $35/hour - $65/hr and, for full-time roles, benefits will include medical insurance depending on your country of residence.\nYour actual pay will be determined on a case-by-case basis and may vary based on the following considerations: job-related knowledge and skills, education, and experience.\n\n\n\n\nxAI is an equal opportunity employer and does not unlawfully discriminate based on race, color, religion, ethnicity, ancestry, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, age, disability, medical conditions, genetic information, marital status, military or veteran status, or any other applicable legally protected characteristics. \n\nQualified applicants with arrest or conviction records will be considered for employment in accordance with all applicable federal, state, and local laws, including the San Francisco Fair Chance Ordinance, Los Angeles County Fair Chance Ordinance for Employers, and the California Fair Chance Act. \n\nFor Los Angeles County (unincorporated) Candidates:\n\nxAI reasonably believes that criminal history may have a direct, adverse and negative relationship on the following job duties, potentially resulting in the withdrawal of a conditional offer of employment: \n\nAccess to information technology systems and confidential information, including proprietary and trade secret information, and/or user data;\nInteracting with internal and/or external clients and colleagues; and\nExercising sound judgment.\n\nCalifornia Consumer Privacy Act (CCPA) Notice"
    },
    {
        "title": "Tutor EAD - Extensão",
        "company": "UniCesumar",
        "location": "Brazil (Remote)",
        "link": "https://www.linkedin.com/jobs/view/4192788120",
        "image": "https://media.licdn.com/dms/image/v2/D4D0BAQHwFH100tDQrQ/company-logo_100_100/company-logo_100_100/0/1708013055513/unicesumaroficial_logo?e=1753315200&v=beta&t=RoUyn41bo1mrOsY3SME-CSHIGg9IK9MHP4Rea09kZ8U",
        "details": "About the job\n\nSomos a Vitru Educação! 💜\n\nA maior instituição privada de ensino EAD do Brasil e referência nacional do ensino presencial e Medicina. Juntos como Vitru, Unicesumar e Uniasselvi, nos dedicamos ao desenvolvimento individual e coletivo. Nossa prioridade é o aprendizado, fazemos do conhecimento um estilo de vida! Nós queremos continuar crescendo, com responsabilidade, mantendo a excelência e os valores que nos trouxeram até aqui e nos levarão adiante!\n\nQuer vir conosco no Universo do Conhecimento? 💜\n\nSe quiser saber mais sobre a Vitru e suas marcas Unicesumar e Uniasselvi, acesse nosso site: https://www.vitru.com.br/.\n\nCarga horária: 44 horas semanais (Segunda a Sexta-feira das 13:00 às 22:42)\n\nResponsabilidades e atribuições\n\n\nAvaliar as atividades extensionistas;\nMonitorar as aulas ao vivo dos produtos da Unicesumar;\nAnalisar ambientes para verificar a conformidade dos mesmos;\nAtender demandas de levantamento de dados;\nRealizar consultas de ambientes.\n\n\n\nRequisitos e qualificações\n\n\nGraduação concluída;\nPós-graduação concluída ou em andamento.\n\n\n\nInformações adicionais\n\nO que você vai encontrar por aqui:\n\n\nBolsa educação para graduação e pós-graduação de 70% à 100% (EAD, Presencial e Híbrido) para o colaborador;\nBolsa educação para graduação e pós-graduação de 70% (EAD, Presencial e Híbrido) para dependentes;\nBolsas educação para Mestrado e Doutorado de 70% de desconto (EAD, Presencial e Híbrido);\nClube de Vantagens para desconto de até 60%, com mais de 300 parcerias em farmácia, viagens, cursos, delivery, eletroeletrônicos e muito mais!\nVale Alimentação/Refeição;\nLicença Maternidade e Paternidade estendida: Válida para filhos biológicos e adotivos, para aproveitar mais o seu bebê e adaptar-se à nova rotina. \nDay Off de Aniversário: Um dia de folga no mês do seu aniversário!\nTelemedicina Pluxee: Mais de dez médicos especialistas disponíveis para atendimento online e gratuito! O benefício inclui consultas médicas, solicitação e análise de exames, prescrições médicas e atestados.\nApoio Pass: Atendimento 24 horas e gratuito com profissionais das áreas da Nutrição, Psicologia, Jurídica, Financeira e Social, extensível para cônjuges e filhos de até 24 anos."
    }
]